spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/when_invalid_card/does_not_make_a_successfull_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4000000000000002&card[cvc]=123&card[exp_month]=3&card[exp_year]=2020
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.1
      Authorization:
      - Bearer sk_test_n4QZH7Y0rhBg0pxsSRPDG0ad
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.1","lang":"ruby","lang_version":"2.3.6 p384 (2017-12-14)","platform":"x86_64-darwin16","publisher":"stripe","uname":"Darwin
        Tomass-MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jan 11 22:59:40
        PST 2018; root:xnu-3789.73.8~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 16 Mar 2018 15:24:11 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '778'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_PhHUspwQ7Lc4oB
      Stripe-Version:
      - '2015-02-10'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1C6KPfAqLMYq45GO6STV4in2",
          "object": "token",
          "card": {
            "id": "card_1C6KPfAqLMYq45GODfaSN1Kz",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 3,
            "exp_year": 2020,
            "fingerprint": "2mMjYtlqYawHVlFY",
            "funding": "credit",
            "last4": "0002",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "88.212.56.2",
          "created": 1521213851,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Fri, 16 Mar 2018 15:24:12 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=999&currency=usd&card=tok_1C6KPfAqLMYq45GO6STV4in2
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.1
      Authorization:
      - Bearer sk_test_n4QZH7Y0rhBg0pxsSRPDG0ad
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.1","lang":"ruby","lang_version":"2.3.6 p384 (2017-12-14)","platform":"x86_64-darwin16","publisher":"stripe","uname":"Darwin
        Tomass-MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jan 11 22:59:40
        PST 2018; root:xnu-3789.73.8~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Fri, 16 Mar 2018 15:24:13 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '201'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_I75ZNxCc4PQwCR
      Stripe-Version:
      - '2015-02-10'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "decline_code": "generic_decline",
            "charge": "ch_1C6KPhAqLMYq45GOXkLqcIuc"
          }
        }
    http_version: 
  recorded_at: Fri, 16 Mar 2018 15:24:13 GMT
recorded_with: VCR 2.9.3
